app/controllers/users_controller.rb

SELECT  "companies".* FROM "companies" ORDER BY "companies"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT COUNT(*) FROM "companies"
---
	def new
		@user = User.new
		@companies = Company.all

SELECT  "tokens".* FROM "tokens" WHERE "tokens"."characters" = $1 LIMIT $2  [["characters", "ok"], ["LIMIT", 1]]
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at", "company_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
UPDATE "tokens" SET "user_id" = $1, "updated_at" = $2 WHERE "tokens"."id" = $3  [["user_id", 7], ["updated_at", 2017-03-18 05:48:10 UTC], ["id", 1]]
---
	def create
		@user = User.new(user_params)
		p user_params
		@token = Token.find_by(characters: params[:user][:unique_token])
		if @token && @token.used? == false && @user.save